<div class="wrap pod-wrap">
	<div class="pdo-wrapper">
		<div class="pdo-card pdo-about">
			<h1><?php  esc_html_e( 'درباره پادرو', 'podro-wp' ) ?></h1>
			<p>پادروپین به عنوان پلتفرم انتخاب و مقایسه خدمات پستی به شما اجازه میدهد تا بتوانید به راحتی با شرکت‌های مختلف پستی کار کنید و به‌صرفه‌ترین و بهترین تصمیم را بگیرید.

شما با پادروپین دیگر نیاز نیست به دفاتر پستی مراجعه کنید، تحویل بسته‌های پستی شما از درب محل انجام خواهد شد و در مقصد به دست مشتری شما خواهد رسید.

پادروپین تجربه متفاوتی را برای پیگیری و پشتیبانی بسته‌های پستی برای شما و مشتریانتان ارائه می‌دهد و همچنین شما به عنوان فروشنده، یک پشتیبان اختصاصی خواهید داشت.
</p>
		</div>
	</div>
	<?php require_once( PODRO_PLUGIN_ROOT . 'admin/views/components/footer.php' ); ?>
</div>
