<div class="wrap">
	<h1><?php echo esc_html_e( 'About Podro', POD_TEXTDOMAIN ) ?></h1>
	<div class="pdo-wrapper">
		<div class="pdo-card pdo-about">
			<p>پادرو پلتفرمی هوشمند در زمینه <strong>تسهیل فرآیند فروش و ارسال در شبکه‌های اجتماعی</strong> و <strong>ارسال محصولات برای فروشگاه‌های آنلاین و سازمان‌های بزرگ</strong> است.
پس از اتصال فروشگاه های اینستاگرامی و یا وبسایت های فروشگاهی به پادرو، فروشندگان می توانند علاوه بر <strong> استفاده از امکانات  فروش محصول از طریق لینک اختصاصی فروشگاه خود</strong>، شرکت پستی مورد نظرشان را انتخاب کنند و بدون مراجعه به دفاتر پستی، محصولاتشان را برای مشتریان ارسال کنند. فرآیند خرید از طریق اتصال خریدار به درگاه امن بانکی و واریز فوری هزینه به حساب فروشنده انجام می شود.

‌
<br>
<strong>پادروپین؛</strong> ‌مارکت‌پلیس خدمات پستی است و به فروشگاه‌های آنلاین کمک می‌کند تا فرآیند ارسال سفارش‌های اینترنتی را مدیریت کنند. در پادروپین، بدون مراجعه و یا ثبت قرارداد با شرکت‌های پستی، می‌توان سفارش‌های اینترنتی را با هر یک از شرکت‌های پستی ارسال کرد
</p>
		</div>
	</div>
</div>
